result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:NDFDgen soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://graphical.weather.gov/xml/DWMLgen/wsdl/ndfdXML.wsdl"><latitude>40.78</latitude><longitude>-111.97</longitude><product>time-series</product><startTime>2020-02-07T07:00:00.000Z</startTime><endTime>2020-02-07T08:00:00.000Z</endTime><Unit></Unit><weatherParameters><maxt>true</maxt><mint>true</mint><temp>false</temp><dew>true</dew><pop12>false</pop12><qpf>false</qpf><sky>false</sky><snow>false</snow><wspd>true</wspd><wdir>false</wdir><wx>false</wx><waveh>false</waveh><icons>false</icons><rh>true</rh><appt>false</appt><incw34>false</incw34><incw50>false</incw50><incw64>false</incw64><cumw34>false</cumw34><cumw50>false</cumw50><cumw64>false</cumw64><critfireo>false</critfireo><dryfireo>false</dryfireo><conhazo>false</conhazo><ptornado>false</ptornado><phail>false</phail><ptstmwinds>false</ptstmwinds><pxtornado>false</pxtornado><pxhail>false</pxhail><pxtstmwinds>false</pxtstmwinds><ptotsvrtstm>false</ptotsvrtstm><pxtotsvrtstm>false</pxtotsvrtstm><tmpabv14d>false</tmpabv14d><tmpblw14d>false</tmpblw14d><tmpabv30d>false</tmpabv30d><tmpblw30d>false</tmpblw30d><tmpabv90d>false</tmpabv90d><tmpblw90d>false</tmpblw90d><prcpabv14d>false</prcpabv14d><prcpblw14d>false</prcpblw14d><prcpabv30d>false</prcpabv30d><prcpblw30d>false</prcpblw30d><prcpabv90d>false</prcpabv90d><prcpblw90d>false</prcpblw90d><precipa_r>false</precipa_r><sky_r>false</sky_r><td_r>false</td_r><temp_r>false</temp_r><wdir_r>false</wdir_r><wspd_r>false</wspd_r><wwa>false</wwa><tstmprb>false</tstmprb><tstmcat>false</tstmcat><wgust>false</wgust><iceaccum>false</iceaccum><maxrh>false</maxrh><minrh>false</minrh></weatherParameters></ns1:NDFDgen></soapenv:Body></soapenv:Envelope>